import Alakazam from "./../../statics/HomePage/Alakazsm.jpg";
import Bulbasaur from "./../../statics/HomePage/Bulb.jpg";
import Charmandir from "./../../statics/HomePage/Charm.jpg";
import Pigi from "./../../statics/HomePage/Pigi.jpg";
import Pikachu from "./../../statics/HomePage/Pika.jpg";
import Scvirt from "./../../statics/HomePage/Scvirt.jpg";
import Wulpiks from "./../../statics/HomePage/Wulpiks.jpg";
import Rattata from "./../../statics/HomePage/Rattata.jpg";

export const dataPageTittle =
  "Покемоны и их имена: краткое описание самых популярных покемонов";
export const dataPageDefinitionsc = `Франшиза Pokémon включает в себя около 809 вымышленных видов коллекционных
 монстров, каждый из которых обладает уникальным дизайном и навыками. Созданные Сатоши Таджири в начале 1989 года,
  покемоны являются существами, населяющими вымышленный мир. Создание покемонов и их имен - творческий процесс.
   Черпать вдохновение можно из чего угодно, например, из неодушевленных предметов, реальных животных или мифологии.
    Многие покемоны способны эволюционировать в более мощные виды, в то время как другие могут претерпевать
     изменения формы и достигать аналогичных результатов. Несколько художников во главе с Кеном Сугимори
      участвовали в разработке данного сказочного мира. Однако к 2013 году команда из 20 художников начала
       создавать новые виды этих существ. Они являются очень популярными среди любителей серии и не только.`;
export const namesAndEvolution = "Покемоны, имена и эволюция";
export const namesAndEvolutionBody = `Из-за большого количества персонажей каждый вид делится по поколениям.
 Покемоны и их имена, а также вся информация о данных существах находится в Покедексе, что является карманной 
 энциклопедией,  включающей в себя множество видов существ и места их обитания.
Как было сказано ранее, многие виды покемонов способны развиваться в более крупное и мощное существо. 
Изменения сопровождаются модификациями статистики, как правило, скромным увеличением и доступом к более широкому 
спектру атак. Есть несколько способов вызвать эволюцию, включая достижение определенного уровня, использование 
специального камня 
 или изучение конкретной атаки. Например, Бульбазавр способен эволюционировать в Ивизавра. 48 покемонов 
 способны к Мега Эволюции или Первичной Реверсии с момента выхода Солнца и Луны. Персонаж может быть мужчиной
  или женщиной, только мужчиной, только женщиной или бесполым.
Интересным фактом является то, что покемоны, герои, имена и все составляющие проекта являются абсолютно уникальной 
частью этого захватывающего мира. После того как мировая популярность настигла данную вселенную, названия некоторых
 персонажей были изменены и подстроены под разные страны и языки мира. В данное время в международном плане 
 оригинальными считаются имена покемонов на английском языке. Однако многих интересует, как звучат названия 
 героев на родном наречии. В данной статье будут представлены имена покемонов на русском языке.
  Давайте рассмотрим самых популярных представителей данного мира. Многих интересуют имена легендарных
   покемонов с их детальным описанием. Об этом также будет рассказано ниже.`;

export const pokemonHomePageList = [
  {
    name: "Alakazam",
    description: `Отличительными внешними признаками данного покемона являются его гуманоидная структура и большие усы.
   У самки алаказама усы значительно короче, чем у самца. Он имеет длинное вытянутое лицо с большими выпуклыми 
   шипами на шее. Также на каждой щеке он имеет еще по одному шипу. Его желтое скелетное тело покрыто коричневыми
    панцирями, которые в своей совокупности напоминают строение тела человека. На каждой ноге три пальца, у каждого
     из которых есть белый коготь. В своих руках Алаказам держит по ложке, которые он использует для усиления 
     своих способностей.Этот покемон обладает особым умением под названием кинезис, с помощью которого он может
      снижать точность своих противников. Алаказам использует свои экстрасенсорные навыки для того, чтобы поддерживать 
      перемещение своего тела, так как он имеет очень слабый мышечный аппарат. Его мозг постоянно растет в размерах
       и тяжелеет, поэтому персонаж использует свои способности для поддержания этого самого главного органа.`,
    img: Alakazam,
  },
  {
    name: "Bulbasaur",
    description: `Бульбазавр является первым видом покемонов в Nintendo и франшизе Game Freak's Pokémon, 
    разработанной Ацуко Нишида. Его название представляет собой сочетание слов «луковица» и «динозавр». 
    Впервые появившись в Pokémon Red and Green как стартовый персонаж, позже он был замечен в последующих сиквелах,
     побочных играх, сопутствующих товарах, а также в анимационных и печатных адаптациях франшизы.

Известный как Семенной Покемон, Бульбазавр может выживать в течение нескольких дней исключительно на солнце.
 Это центральный персонаж в аниме, являющийся одним из главных персонажей Эша в первом сезоне. 
 Он представлен в различных мангах и принадлежит главному герою Red в манге Pokémon Adventures. 
 Бульбазавр был использован в бесчисленных продуктах, включая игрушки, брелки и плюшевые куклы. 
 Дизайн бульбазавра и его эволюция основаны на лягушках. Во франшизе покемонов это маленькие амфибии
  и покемоны-растения, которые двигаются на всех четырех ногах и имеют светлые сине-зеленые тела с более 
  темными сине-зелеными пятнами.`,
    img: Bulbasaur,
  },
  {
    name: "Charmandir",
    description: `Далее представлены фото и имена покемонов. На русском название этого персонажа - Чармандер. 
    Это герой оранжевого цвета, передвигающийся на двух ногах. Его нижняя сторона от груди вниз и до подошвы
     имеет кремовый раскрас. В верхней и нижней челюсти он имеет по два клычка. Его руки и ноги коротенькие,
      на руках у него четыре пальца, и три когтистых пальца на ногах. На кончике хвоста этого покемона горит пламя, 
      которое поддерживает свою силу с самого рождения Чармандера. По состоянию его пламени можно определить 
      состояние здоровья и настроения Чармандера. Например, когда он находится в активном расположении духа, 
      пламя ярко сияет, ослабевает же оно, когда он устает; когда он счастлив, пламя блестит, а когда он во гневе, 
      оно пылает. Говорят, что когда пламя Чармандера прекращает быть видимым, существо покидает этот мир.
       Естественная среда обитания данного вида – горные районы с жарким солнечным покрытием.`,
    img: Charmandir,
  },
  {
    name: "Pigi",
    description: `Пиджи - это маленький пухлый покемон-птица. Его тело имеет коричневый окрас с кремовым лицом. 
    На вершине его головы находится короткий гребень из трех пучков. Центральные перья гребня коричневые, 
    а внешние два пучка кремового цвета. Прямо под гребнем можно увидеть его узкие карие глаза.
     Угловая черная отметина простирается из-за его глаз вниз по его щекам. У него короткий коротенький
      клюв и ступни с двумя пальцами спереди и одним сзади. Клюв и ноги серовато-розовые. Также он имеет коротенький 
      коричневый хвост из трех перьев.

У Пиджи чрезвычайно острое чувство направления и инстинкты самонаведения. Он может найти свое гнездо,
 даже если сам находится далеко от привычного окружения. Это послушный покемон, он обычно предпочитает бежать 
 от своих врагов, а не сражаться с ними. Быстро взмахивая крыльями, он может взбивать пылевые облака и создавать вихри,
  чтобы защитить себя и избавиться от потенциальной угрозы.`,
    img: Pigi,
  },
  {
    name: "Pikachu",
    description: `Пикачу – это разновидность покемонов, похожих на грызунов и обладающих сильными электрическими
     способностями. В большинстве своем все появления этого покемона были озвучены Икуэ Отани.
      Дизайн Пикачу был задуман Ацуко Нишида и завершен Кеном Сугимори. Первое появление персонажа произошло
       в Pokemon Red и Green в Японии, а затем в первых выпущенных на международном уровне видеоиграх серии Pokemon.

Пикачу является одним из самых известных и популярных покемонов благодаря его появлению в сериале, где он был
 главным спутником Эша. Пикачу считается главным персонажем франшизы Pokémon, а также ее талисманом, и в последние
  годы стал иконой японской поп-культуры. Изначально герой является уникальным существом, умеющим владеть
   электричеством. Также отличительной чертой его внешнего вида являются красные кружочки на щеках, которые
    могут искриться.`,
    img: Pikachu,
  },
  {
    name: "Scvirtl",
    description: `Сквиртл является разновидностью покемонов во франшизе Nintendo и Game Freak's Pokémon.
     Он был разработан благодаря Ацуко Нишида. Он был назван этим именем во время английской локализации
      сериала с целью того, чтобы придать ему запоминающееся имя.

В анимационных фильмах Сквиртл озвучивается на японском языке Рикако Айкава, а в английских локализациях - 
Эриком Стюартом, а позднее – Мишелем Нотцем. В аниме персонаж никогда не развивался по причинам, которые никогда
 не объяснялись создателями.

Сквиртл – это маленький симпатичный черепахоподобный покемон, способный двигаться либо на двух ногах, либо
 на четвереньках. Он имеет кожу светло-синего цвета, и у него длинный, завитый хвост. Чувствуя угрозу, 
 Сквиртл убирает свои конечности в коричнево-оранжевые раковины и с большой силой распыляет воду изо рта, 
 чтобы атаковать противника или просто запугать его.`,
    img: Scvirt,
  },
  {
    name: "Wulpiks",
    description: `Вульпикс - это маленький четвероногий лисоподобный покемон. У него красно-коричневая шкура,
     коричневые глаза без зрачков, большие заостренные уши с темно-коричневыми внутренностями и шесть оранжевых 
     хвостов с загнутыми кончиками. У Вульпикс также есть завитые пряди оранжевого меха с челкой на голове.
      Вульпиксы рождаются с одним белым хвостом, который с возрастом разделяется на шесть оранжевых.
       У этого покемона кремовый живот и коричневые ноги с более светлыми коричневыми подушечками лап. 
       Внутри Вульпикса есть пламя, которое никогда не гаснет.

Персонаж способен управлять огнем с такой точностью, что создает пылающие пучки пламени. Когда температура 
на улице увеличивается, он извергает пламя изо рта, чтобы предотвратить перегревание тела. Известно, что Вульпикс
 симулирует смерть, чтобы убежать от противников, слишком сильных для него. Чаще всего этот вид можно найти
  на травянистых равнинах`,
    img: Wulpiks,
  },
  {
    name: "Rattata",
    description: `Раттата - это маленький покемон, похожий на четвероногого грызуна. 
    Его наиболее заметная особенность - большие зубы. Как и у большинства грызунов, 
    его зубы непрерывно растут на протяжении всей жизни. Раттата имеет фиолетовый мех на 
    спине и кремовый мех на животе. У него есть пара тонких, кремовых усов и длинный хвоста, 
    который завивается на кончике. У самок короткие усы и более светлый мех. Раттата живет везде, 
    где он может найти еду, которую ищет большую часть дня. Благодаря своим острым клыкам он может есть
     почти все. Когда ему угрожают, Раттата может нанести мощный укус. Его выносливость позволяет ему жить во
      многих средах, хотя в основном он живет на равнинах и в саваннах. Поскольку этот вид быстро размножается, 
      пара таких покемонов может быстро колонизировать территорию.`,
    img: Rattata,
  },
];
