export const dataPage = `Pokemon для жителей всего мира уже давно ассоциируется не только с популярным персонажем одноименной компьютерной игры, 
но и целым спектром развлечений для всей семьи. За 20 лет аниме-франшиза пополнилась 11 фильмами, 
12 сезонами ТВ-шоу, коллекционной карточной игрой и 25 видеоиграми. В честь «карманных монстров» проводятся даже Саммиты Национального 
движения и Международные чемпионаты. 
В 1996 году студия Game Freak разработала компьютерную игру Pokemon. 
Существует легенда, что ее создатель – разработчик компьютерных игр Сатоси Тадзири – задумался над созданием игры, 
впоследствии получившей мировую популярность, когда увидел, как жук залез на провод. 
Тадзири увлекался коллекционированием насекомых и поэтому придумал игру, где можно было развивать монстров и обмениваться ими с друзьями, 
чтобы собрать полную коллекцию. На создание игры у Тадзири ушло шесть лет – создатель игры хотел выпустить нечто по-настоящему грандиозное. 
Игра, где изначально присутствовало 25 монстров, изначально называлась Capsule Monsters. 
Суть игры сводилась к подготовке монстров, обладающих разными сверхъестественными способностями, к сражением с монстрами других игроков.
Игра заканчивалась тогда, когда одна из команд покемонов побеждала другую.Игра Capsule Monsters привлекла внимание Nintendo, 
японской компании, специализирующаяся на создании видеоигр и игровых консолей. Nintendo решила зарегистрировать название игры Capsule Monsters 
(«капсульные монстры») как торговую марку, однако столкнулась с проблемой – одноименная торговая марка уже была зарегистрирована. 
В итоге игра сначала была переименована в Capumon, затем в Kapumon, а затем в Pocket Monsters или Pokémon. 
Новое название игры отсылало к одноименной популярной карточной игре в Японии (за всю историю ее существования было продано больше 21,5 млрд.
 карточных наборов).
Поскольку к моменту выхода новой компьютерной игры Game Boy, портативная консоль с двумя приставками для которой и была разработана игра, 
потерял свою былую популярность, на успех «Покемона» никто не рассчитывал. Тадзири был даже вынужден не платить своим работникам. 
Помощь пришла с неожиданной стороны: создателя «Покемона» поддержал японский геймдизайнер Сигэру Миямото (создал такие серии видеоигр как Mario, 
Donkey Kong, The Legend of Zelda, Star Fox, Nintendogs, Wave Race и Pikmin). 
Именно Миямото помог Тадзири  выпустить первые две игры про покемонов - Pocket Monsters Red и Pocket Monsters Green. 
В первых двух играх был 151 вид покемонов.Игра стала успешной сразу после ее выхода. По мотивам игр вышло аниме, а позже была разработана игра 
Pokémon Yellow, представляющая собой комбинацию Red и Blue, но более приближенную к аниме. Компания Nintendo настолько воодушевилась успехом 
«Покемона», что одна за другой  выпустила одноименные игры (Pokémon Stadium и Pokémon Stadium 2) для игровой приставки Nintendo 64.
За 20 лет вышло шесть поколений популярной игры, изданы новые части франшизы (Pokemon X и Pokemon Y - для Nintendo 3DS) 
и разработаны побочные игры. В концу 2016 года Nintendo намерена запустить еще две новых игры для 3DS консолей - «Pokemon Sun» 
и «Pokemon Moon» и новые функции (например, «Покемон-банк», с помощью которого игрок будет иметь возможность перенести персонажа
 из одной игры в другую).GamesRadar поместил серию на первое место в списке лучших серий игр Nintendo, не разработанных Nintendo собственноручно, 
 а IGN поместил серию на 17-е место в списке 25 лучших серий игр всех времён, заявив, что «геймплей очень хорош, игровая механика затягивает 
 и ролевые игры из этой серии на портативные консоли заслуживают того, чтобы быть в коллекции любого геймера».
Разработчики популярной игры решили масштабно отметить юбилей бренда. Так, 28 февраля на улицы Манхэттена вышли 20 клонов Пикачу, 
одного из самых популярных героев игры.Днем ранее, 27 февраля  The Pokemon Company включила круглосуточную трансляцию на своем канале в Twitch,
 показывая фильмы и шоу о покемонах, а также обсуждая их влияние на культуру.  Для iOS вышло специальное приложение Pokemon Photo Booth, 
 позволяющее создавать коллажи на тему покемонов.
Отметим, что в реальном мире существует официальный международный чемпионат по видеоигре и карточной игре - Pokemon (World Championships). 
В этом году Россия вошла в число стран, принимающих официальное участие в международных отборах на Чемпионат мира. 
В прошлом году, когда двое игроков из нашей страны уже участвовали в большом трехдневном турнире в Бостоне, Россия впервые приняла участие в 
Чемпионате мире, но тогда национальные отборы проводились по упрощенной схеме.`